wangnan31415926/nrf5-sdk-15.3.0/examples/ble_peripheral/ble_app_bma250E/main.c
/**@brief Function for changing the tx power.
 */
static void tx_power_set(void)
{
    ret_code_t err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV, m_advertising.adv_handle, 8);
    APP_ERROR_CHECK(err_code);
}

nrfx_gpiote_evt_handler_t Button_handle(nrfx_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
	 printf("\r\nGPIOE.\r\n");
}

//GPIOTE 中断初始化
void GPIOTE_init(void)
{
    ret_code_t err_code;    
  
    err_code=nrf_drv_gpiote_init();//GPIOTE初始化
    APP_ERROR_CHECK(err_code);
    
    
    //输入中断配置
    nrf_drv_gpiote_in_config_t button_config=GPIOTE_CONFIG_IN_SENSE_LOTOHI(true);//上升沿触发
    button_config.pull=NRF_GPIO_PIN_PULLUP;  //
    err_code=nrf_drv_gpiote_in_init(BUTTON_0,&button_config,Button_handle);
    APP_ERROR_CHECK(err_code);
    nrf_drv_gpiote_in_event_enable(BUTTON_0,true);
}

/**@brief Application main function.
 */
extern void SCL_(void);
int main(void)
{
    bool erase_bonds;
    // Initialize.
//GPIOTE_init();
	//GPIOTE中断
	
	//GPIOTE中断 end
    uart_init();
//    log_init();
    timers_init();
//    buttons_leds_init(&erase_bonds);
		APP_SCHED_INIT(50,30);  //wn
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
	  tx_power_set();
    advertising_start();
//	

bma_init();
application_timers_start();
    // Enter main loop.
    for (;;)
    {
			  app_sched_execute();
        idle_state_handle();
    }
}


/**
 * @}
 */
